

//-------------------------------------------------- КЛАСИ ТА НАСЛІДУВАННЯ ----------------------------------------------------------
// всередині класу існує конструктор
// генерують майбутній об'єкт, до якого можемо звернутися через this
// в конструкторі ми визначаємо поведінку функції, а в класах безпосередньо в тілі


class User {

    constructor(name, age) {
        this.name = name;
        this.age = age;
    }

    greeting() {
        return `Hello, my name is ${this.name}`;
    }

}

let user = new User('Vi', 18);
console.log(user)
console.log(user.greeting());


 //----------------------------------------------------------
// функція в межах класу називається методом
//


































