console.log('hello');


// ---------------------------------------------------------- ЗМІННІ ---------------------------------------------------------------------

// декларувати змінну - проголошувати

// ініціалізація змінної - виконання; ряд дій, що передують виконання.

// блок ініціалізації - кімната, в якій блок може виконуватися

// let - видима лише в межах блоку ініціалізації. Звернення до неї за межами неможливе. Це безпека. var - ігнорує кімнати. Є більш глобальною.
// const - константи прийнято називати КАПСОМ. Їх неможна перевизначити/переініціалізувати.

// кастування - приведення. кастується - приводиться до

let a = 'hello Kio';
console.log(a);

const PI = 3.14;
console.log(PI);


// ------------------------------------------------------- БАЗОВІ ТИПИ ДАННИХ --------------------------------------------------

// буля використовується в логічних розгалуженнях, коли треба щось перевірити
// > < >= <=  / == === еквівалентність / != !== нееквівалентність/


let b = 'Parfnoth';
b = '8';
console.log(typeof b, b);

let c = true;
console.log(c);


//  `` - шаблонна строка через Бєкквоти. Перевага - КОНКАТИНАЦІЯ - процес з'єднання стрінг в одну єдину стрінгу.
// `${ }` - інтерполяція


let greeting = 'hello';
let intro = 'my name is Yukisa';

let msg = greeting + ' ' + intro;
console.log(msg);

let msg2 = `${greeting} ${intro}`
console.log(msg2);



// integer - цілочисленні числа / 100500
// float, double - числа з плаваючою крапкою / 3.559485384
// bigint - дуже великі числа / 198688398573898349340086340n - n в кінці щоб розуміло що це дійсно просто число/ BigInt(...)

console.log(10 + 20);
console.log(11 % 3); // ділення по модулю, 11 = 3+3+3+2 - визначаємо кратність. парнісь числ і т.д.


let n1 = 100;
let n2 = 200;
console.log(n1 + n2);



// при строгій еквівалентності процес конвертації не відбувається, стрінга !== числу.
// При нестрогій відбувається конвертація, порівнюються аскікоди/ стрінга == числу
// Якщо порівнюємо стрінги, спочатку перевіряється їх довжина, потім вага по аскікодам

console.log(10 !== 99);
console.log('asd' === 'asd');



// ---------------------------------------------------------------------- КОНВЕРТАЦІЯ ТИПІВ ----------------------------------------------------------------------

// конвертація в стрінгу
console.log(100500 + ' ')

console.log(100 + 200 + ' ') // 300 string
console.log(' ' + 100 + 200) // 100200 string - послідовність!

// стрінга в число
console.log(+'100500') // + конвертне в число
console.log(parseInt('100300.8788887uhkh')); // такий тип відсікає все, що не переводиться в число + округлює
console.log(parseFloat('100300.8788887uhkh')); // такий тип відсікає все, що не переводиться в число + не округлює

// конвертація в булю / кастування до булевого значення
console.log(!!100800); // true
console.log(!!0); // false

console.log(!!'asd')
console.log(!!'')

// буля в стрінгу
console.log(true + '');
console.log(+ true); // кастується до 1
console.log(+ false); // кастується до 0
console.log(100 + true) // 101
console.log(100 - true) // 99








