
//--------------------------------------------------------- МЕТОДИ МАСИВІВ -----------------------------------------------------

let arr = [];
console.log(Array.isArray(arr));


arr[arr.length] = 123;      // додає елемент в масив


//------------------------------------------------------ ДОДАСТЬ ЕЛЕМЕНТ ---------------------------------------------
// .push - додає елемент в кінець масиву
// не повертаємо новий, а саме оновлюємо данний

arr.push('Chess Bonifoger')
console.log(arr);



// .unshift - додасть елемент на початок масиву

arr.unshift('Lacus Wiagarty')
console.log(arr);



//---------------------------------------------------------- ВИРІЗАЄ ЕЛЕМЕНТ ПОЧ/КІН------------------------------------------------
// .pop - вирізає останній елемент з масиву
// може повернути той елемент, який вирізав

console.log(arr.pop())
console.log(arr);



// .shift - визізає перший елемент з масиву/ видаляє з початку

console.log(arr.shift());
console.log(arr);



//------------------------------------------------------- З'ЄДНУЄ ЕЛЕМЕНТИ -------------------------------------------------
// .join - з'єдгує елементи масиву в обну стрінгу, також можна вказати розподілювач

let arr2 = ['Adalaide de Azu', 'Minerva', 'Agafonika de Azu']

console.log(arr2.join('...'))
console.log(arr2.join(', and '))



//---------------------------------------------------- З'ЄДНУЄ МАСИВИ -----------------------------------------------------------
// .concat - конкатинація (з'єднання) масивів
// повертає абсолютно НОВИЙ МАСИВ


let arr3 = arr.concat(arr2);
console.log(arr3);
console.log(arr);



//------------------------------------------------------ МЕНЯЄ МІСЦЯМИ -----------------------------------------------------

// .reverse - реверсне масив

console.log(arr3.reverse());



//--------------------------------------------------- НАРІЗАЄ МАСИВ ШМАТКАМИ ----------------------------------------------------------
// .slice - вирізає елементи по певним межам, залишаючи в масиві. Не ділить на окремі об'єкти.
// використовує індекси
// вирізаний шматок є НОВИМ МАСИВОМ

console.log(arr3.slice(0, 2))                    // вирізав 1й та 21 елементи



//----------------------------------------------------- ВИДАЛЯЄ ПЕВНІ ЕЛЕМЕНТИ З МАСИВУ ------------------------------------------------------
// .splice - можна вирізати елементи з масиву по певним межам
// використовує по індексам

let arr4 = [10, 20, 30, 40, 50, 60];
console.log(arr4)
console.log(arr4.splice(1, 3));    // те, що виріїається - тепер НОВИЙ МАСИВ
console.log(arr4);


// можна навіть вказувати необмежену к-сть значень, які треба вставити замість видалених


let arr5 = [11, 22, 33, 44, 55, 66];
// console.log(arr5.splice(1, 3,'Lyam', 'Ray', 'Monalyne'))    // виведе що вирізали
console.log(arr5.splice(1, 3,999, 1000))
console.log(arr5)                                                                   // виведе масив з оновленими елементами



//---------------------------------------------------- ВИВЕДЕ ІНДЕКС ЕЛЕМЕНТУ -----------------------------------------------------
// .indexOf

console.log(arr5.indexOf(55));

arr5.splice(arr5.indexOf(4), 1);
console.log(arr5);                // починаючи з 4го індексу видалим один елемент



//---------------------------------------------------------- ПЕРЕВІРКА НАЯВНОСТІ ----------------------------------------------------------
// .includes - виведе, чи є певний елемент в масиві, або ні

console.log(arr5.includes(44))
console.log(arr5.includes(11))

// includes можна використовувати по-ріному. Перевіряючи, чи є в певному об'єкті якесь значення і навпаки, чи є якесь значення в об'єкті.
console.log('black'.includes(cards[0].color))
console.log(cards[0].color.includes('red'))















