

//--------------------------------------------------------- МЕТОДИ СТРІНГА ----------------------------------------------------------------

// під капотом стрінга сприймається як масив символів, тому можна робирати str[0], ітерувати.
// стрінга і примітив, і референсіальний тип

let str = 'Yukisa Kio'
console.log(str);



//--------------------------------------------------------- ДОДАЄ ------------------------------------------------------------------
// .CONCAT - заміна конкатинації через плюси. Додавання.
// повертає нам абсолютно оновлене значення, сама str НЕ ЗМІНИЛАСЯ

let s = str.concat(' is a young agel.');
console.log(s);



//------------------------------------------------------ РЕГІСТР ----------------------------------------------------------
// .toUpperCase - новий об'єкт, але верхнім регістром. КАПС.
// .toLowerCase - новий об'єкт нижнім регістром.

console.log(s.toUpperCase());



//-------------------------------------------------- ПЕРЕВІРЯЄ ПОЧ/КІН ------------------------------------------------------------
// .startsWith - дозволяє в якості аргументу передати секвенсію (послідовність) символів, з яких може починатися стрінга.
// .endsWith - дозволяє в якості аргументу передати секвенсію символів, якими може закінчуватися стрінга
// А-ля пошук. Якщо таке є, поверне true

console.log(s.startsWith('Yuk'))   // true



//----------------------------------------------------- ВИРІЗАЄ СИМВОЛИ --------------------------------------------------
// .substring - вирізає стрінгу і аргументами можемо вказувати межі.

console.log(s.substring(0, 5))     // вирізав арг0, 1, 2, 3, 4. разом 5 символів
console.log(s.substring(4, 9))     // вирізав арг3-7, разом 5 символів



//----------------------------------------------------- ПОКАЖЕ ІНДЕКС ---------------------------------------------------------
// .indexOf - покаже під яким індексом в поточній стрінзі певний символ. Регістр має значення.
// .lastIndexOf - працює так само, але з кінця. З право на ліво.
// обидві показують індекс першого знайденого символу /з початку /або з кінця

console.log(s.indexOf('Y'))
console.log(s.indexOf('y'))
console.log(s.indexOf('u'))        // 1
console.log(s.lastIndexOf('l'))
console.log(s.lastIndexOf('Y'))

// існує 2й аргумент, який вказує з якого індексу починаємо шукати

console.log(s.indexOf('u', 5))   //18



//----------------------------------------------------- ПОКАЖЕ СИМВОЛ ---------------------------------------------------
// .charAt - приймає як аргумент число і повертає символ, який знаходиться за данним символом

console.log(s.charAt(1));



//---------------------------------------------------- ЗАМІНЯЄ СИМВОЛИ --------------------------------------------------
// .replace - дозволяє замінити певний символ на інший
// заміняє лише перший зустрічний символ/секвенцію
// .replaceAll - заміняє УСІ наявні в стрінзі символи/cеквенції

console.log(s.replace('isa ', 'i Sa'))
console.log(s.replaceAll(' ', '_'))



//---------------------------------------------------- ДІЛИТЬ НА ОБ'ЄКТИ ------------------------------------------------------
// .split - через певний символ ділить стрінгу на об'єкти і кладе у масив

console.log(s.split(' '))

